"""
#Задание 1. Определение типов данных
integer = int(input("Введите целое число: "))
decimal = float(input("Введите дробное число: "))
text = input("Введите строку: ")
#Вывод типов и значений
print(f"Значение: {integer}, тип: {type(integer).__name__}")
print(f"Значение: {decimal}, тип: {type(decimal).__name__}")
print(f"Значение: {text}, тип: {type(text).__name__}")"""

#Задание 2. Арифметические операции
#Ввод данных
a = float(input("Введите первое число: ")) 
b = float(input("Введите второе число: "))
#Вычисление и вывод результатов
print(f"Сумма: {a + b}")
print(f"Разность: {a - b}")
print(f"Произведение: {a * b}")
print(f"Частное: {a / b}")
print(f"Целая часть от деления: {a // b}")
print(f"Остаток от деления: {a % b}")
print(f"Возведение в степень: {a ** b:.2f}")
